# 問1
lx = [c for c in range(8) if c != 0] # 三角形の底辺を求める(1〜30までの数列)
ly = [c for c in range(8) if c != 0] # 三角形の高さを求める(1〜30までの数列)
a1 = [] # 答えのリスト
for i in lx:
    for j in ly:
        a1.append(i ** 2 + j ** 2) # a1にlx, lyそれぞれの要素の2乗の和を追加していく
a1 = sorted(a1) # a1をソート
print("重複除去前\n", "\rn = {", ", ".join(list(map(str, a1))), "}", end="\n\n") # 重複を除去する前のa1を表示
a1 = list(set(a1)) # a1の重複を除去
print("50まで\n", "\rn = {", ", ".join(list(map(str, [c for c in a1 if c <= 50]))), "}\n", end="\n\n") # n<51(nは整数)の格子点間距離を表示
print("全リスト\n", "\rn = {", ", ".join(list(map(str, a1))), "}",end="\n\n") # 求まったnをすべて表示

# 以下、出力を記載

# 重複除去前
# n = { 2, 5, 5, 8, 10, 10, 13, 13, 17, 17, 18, 20, 20, 25, 25, 26, 26, 29, 29, 32, 34, 34, 37, 37, 40, 40, 41, 41, 45, 45, 50, 50, 50, 52, 52, 53, 53, 58, 58, 61, 61, 65, 65, 72, 74, 74, 85, 85, 98 }

# 50まで
# n = { 2, 5, 8, 10, 13, 17, 18, 20, 25, 26, 29, 32, 34, 37, 40, 41, 45, 50 }


# 全リスト
# n = { 2, 5, 8, 10, 13, 17, 18, 20, 25, 26, 29, 32, 34, 37, 40, 41, 45, 50, 52, 53, 58, 61, 65, 72, 74, 85, 98 }
